<font color="blue" size="6">Combine Categorical Data</font>

In this example orders are placed from many cities here we combine less frequently ordered cities as others.

In [1]:
import numpy as np
import pandas as pd  
# making data frame from csv file  
data = pd.read_csv("DATASETS\\order.csv")
df = pd.DataFrame(data)

df

     Oderno     Status   Book      City
0         1  Completed      A   Chennai
1         2  Completed      B   Chennai
2         3  Completed      C   Chennai
3         4  Completed      D   Chennai
4         5  Completed      E   Chennai
..      ...        ...    ...       ...
808     809  Completed  F_804    Bombay
809     810  Completed  F_805    Bombay
810     811  Completed  F_806    Bombay
811     812  Completed  F_807  Calcutta
812     813  Completed  F_808  Calcutta

[813 rows x 4 columns]

In [2]:
count=df['City'].value_counts()
count

Bangalore     273
Coimbatore    175
Madurai       161
Chennai        47
Trichy         36
Ooty           23
Mysore         16
Hyderabad      14
Cochin         12
Jaffna          8
Cuttak          8
Hoogly          7
Srinagar        6
Patna           6
Goa             5
Ranchi          4
Indore          4
Delhi           3
Bombay          3
Calcutta        2
Name: City, dtype: int64

In [3]:
df['City']=df['City'].str.lower()
df

     Oderno     Status   Book      City
0         1  Completed      A   chennai
1         2  Completed      B   chennai
2         3  Completed      C   chennai
3         4  Completed      D   chennai
4         5  Completed      E   chennai
..      ...        ...    ...       ...
808     809  Completed  F_804    bombay
809     810  Completed  F_805    bombay
810     811  Completed  F_806    bombay
811     812  Completed  F_807  calcutta
812     813  Completed  F_808  calcutta

[813 rows x 4 columns]

In [4]:
top9=df['City'].value_counts().nlargest(9).index

In [5]:
top9

Index(['bangalore', 'coimbatore', 'madurai', 'chennai', 'trichy', 'ooty',
       'mysore', 'hyderabad', 'cochin'],
      dtype='object')

In [6]:
df['City'].where(df['City'].isin(top9),'other')

0      chennai
1      chennai
2      chennai
3      chennai
4      chennai
        ...
808      other
809      other
810      other
811      other
812      other
Name: City, Length: 813, dtype: object

In [7]:
df['City_Cat']=df['City'].where(df['City'].isin(top9),'other')
df.head()

   Oderno     Status Book     City City_Cat
0       1  Completed    A  chennai  chennai
1       2  Completed    B  chennai  chennai
2       3  Completed    C  chennai  chennai
3       4  Completed    D  chennai  chennai
4       5  Completed    E  chennai  chennai

In [8]:
df['City_Cat'].value_counts()

bangalore     273
coimbatore    175
madurai       161
other          56
chennai        47
trichy         36
ooty           23
mysore         16
hyderabad      14
cochin         12
Name: City_Cat, dtype: int64